# Задача 2. Напишите программу, которая позволяет считывать из файла вопрос, 
# отвечать на него и отправлять ответ обратно пользователю.
import random

# user = input(f'Введите \n'
#              f'()\n'
#              f'или введите "cтоп" для завершения программы\n'
#              f': ').lower()

# n = [random.randint(0, 10) for el in range(length)]
# p = ''.join([string[random.randint(0, len(string) - 1)] for _ in range(length)])

# print(f'{=}')
# print(f'{=} {}')
