# Задача 1. Дано натуральное число N. 
# Найдите значение выражения:N + NN + NNN
# N может быть любой длины.

import random


# user = input(f'Введите \n'
#              f'()\n'
#              f'или введите "cтоп" для завершения программы\n'
#              f': ').lower()

# n = [random.randint(0, 10) for el in range(length)]
# p = ''.join([string[random.randint(0, len(string) - 1)] for _ in range(length)])

# print(f'{=}')
# print(f'{=} {}')
