# Задача 3. Постройте диаграмму количества студентов заочной формы обучения за 2019 год по всем регионам, 
# в которых общее количество студентов не превышает 10000 за данный год.
import random

# user = input(f'Введите \n'
#              f'()\n'
#              f'или введите "cтоп" для завершения программы\n'
#              f': ').lower()

# n = [random.randint(0, 10) for el in range(length)]
# p = ''.join([string[random.randint(0, len(string) - 1)] for _ in range(length)])

# print(f'{=}')
# print(f'{=} {}')
