# Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6), 
# которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца. 
# Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны. 
# Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля).
# Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения.
import random

# user = input(f'Введите \n'
#              f'()\n'
#              f'или введите "cтоп" для завершения программы\n'
#              f': ').lower()

# n = [random.randint(0, 10) for el in range(length)]
# p = ''.join([string[random.randint(0, len(string) - 1)] for _ in range(length)])

# print(f'{=}')
# print(f'{=} {}')
